{"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null,"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input_sequence","class_name":"InputLayer","config":{"batch_input_shape":[null,24,10],"dtype":"float32","sparse":false,"name":"input_sequence"},"inbound_nodes":[]},{"name":"bilstm_1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"forward_lstm","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bilstm_1","trainable":true},"inbound_nodes":[[["input_sequence",0,0,{}]]]},{"name":"dropout_1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_1","trainable":true},"inbound_nodes":[[["bilstm_1",0,0,{}]]]},{"name":"bilstm_2","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"forward_lstm_2","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bilstm_2","trainable":true},"inbound_nodes":[[["dropout_1",0,0,{}]]]},{"name":"dropout_2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_2","trainable":true},"inbound_nodes":[[["bilstm_2",0,0,{}]]]},{"name":"dense_shared","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_shared","trainable":true},"inbound_nodes":[[["dropout_2",0,0,{}]]]},{"name":"batch_norm","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_norm","trainable":true},"inbound_nodes":[[["dense_shared",0,0,{}]]]},{"name":"output_status","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output_status","trainable":true},"inbound_nodes":[[["batch_norm",0,0,{}]]]},{"name":"output_liter","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output_liter","trainable":true},"inbound_nodes":[[["batch_norm",0,0,{}]]]},{"name":"output_activity","class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"output_activity","trainable":true},"inbound_nodes":[[["batch_norm",0,0,{}]]]}],"input_layers":[["input_sequence",0,0]],"output_layers":[["output_status",0,0],["output_liter",0,0],["output_activity",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js","weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bilstm_1/forward_forward_lstm/kernel","shape":[10,512],"dtype":"float32","paths":["weights.bin"]},{"name":"bilstm_1/forward_forward_lstm/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bilstm_1/forward_forward_lstm/bias","shape":[512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/kernel","shape":[10,512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/bias","shape":[512],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/kernel","shape":[256,256],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/bias","shape":[256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/kernel","shape":[256,256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/bias","shape":[256],"dtype":"float32"},{"name":"dense_shared/kernel","shape":[128,32],"dtype":"float32"},{"name":"dense_shared/bias","shape":[32],"dtype":"float32"},{"name":"batch_norm/gamma","shape":[32],"dtype":"float32"},{"name":"batch_norm/beta","shape":[32],"dtype":"float32"},{"name":"output_status/kernel","shape":[32,1],"dtype":"float32"},{"name":"output_status/bias","shape":[1],"dtype":"float32"},{"name":"output_liter/kernel","shape":[32,1],"dtype":"float32"},{"name":"output_liter/bias","shape":[1],"dtype":"float32"},{"name":"output_activity/kernel","shape":[32,10],"dtype":"float32"},{"name":"output_activity/bias","shape":[10],"dtype":"float32"},{"name":"batch_norm/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_norm/moving_variance","shape":[32],"dtype":"float32"}]}]},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bilstm_1/forward_forward_lstm/kernel","shape":[10,512],"dtype":"float32","paths":["weights.bin"]},{"name":"bilstm_1/forward_forward_lstm/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bilstm_1/forward_forward_lstm/bias","shape":[512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/kernel","shape":[10,512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/recurrent_kernel","shape":[128,512],"dtype":"float32"},{"name":"bilstm_1/backward_forward_lstm/bias","shape":[512],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/kernel","shape":[256,256],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bilstm_2/forward_forward_lstm_2/bias","shape":[256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/kernel","shape":[256,256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"bilstm_2/backward_forward_lstm_2/bias","shape":[256],"dtype":"float32"},{"name":"dense_shared/kernel","shape":[128,32],"dtype":"float32"},{"name":"dense_shared/bias","shape":[32],"dtype":"float32"},{"name":"batch_norm/gamma","shape":[32],"dtype":"float32"},{"name":"batch_norm/beta","shape":[32],"dtype":"float32"},{"name":"output_status/kernel","shape":[32,1],"dtype":"float32"},{"name":"output_status/bias","shape":[1],"dtype":"float32"},{"name":"output_liter/kernel","shape":[32,1],"dtype":"float32"},{"name":"output_liter/bias","shape":[1],"dtype":"float32"},{"name":"output_activity/kernel","shape":[32,10],"dtype":"float32"},{"name":"output_activity/bias","shape":[10],"dtype":"float32"},{"name":"batch_norm/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_norm/moving_variance","shape":[32],"dtype":"float32"}]}]}